# CUSTOVER SEGMENTATION USING RFM PACKAGE MADE USING QUANTILES

In [4]:
#CUSTOMER SEGMENTATION USING RFM PACKAGE MADE USING LIFETIMES PACKAGE

In [5]:
#CUSTOMER SEGMENTATION USING LR, GBM

In [6]:
#CUSTOMER SEGMENTATION USING MODIFIED BETA GEO + GAMMA GAMMA MODEL + KMEANS

In [7]:
#MONTE CARLO SIMULATION ON TOP OF MBG DATA + K-MEANS ON SIMULATED DATA

In [8]:
# importing packages start

In [3]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
df = pd.read_excel("Online_Retail_data.xlsx")
df.head()
df1 = df

In [4]:
import matplotlib.pyplot as plt

In [5]:
# importing packages ends

In [6]:
df1.Country.nunique()

40

In [7]:
df1.Country.unique()

array(['United Kingdom', 'France', 'USA', 'Belgium', 'Australia', 'EIRE',
       'Germany', 'Portugal', 'Japan', 'Denmark', 'Nigeria',
       'Netherlands', 'Poland', 'Spain', 'Channel Islands', 'Italy',
       'Cyprus', 'Greece', 'Norway', 'Austria', 'Sweden',
       'United Arab Emirates', 'Finland', 'Switzerland', 'Unspecified',
       'Malta', 'Bahrain', 'RSA', 'Bermuda', 'Hong Kong', 'Singapore',
       'Thailand', 'Israel', 'Lithuania', 'West Indies', 'Lebanon',
       'Korea', 'Brazil', 'Canada', 'Iceland'], dtype=object)

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525461 entries, 0 to 525460
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      525461 non-null  object
 1   StockCode    525461 non-null  object
 2   Description  522533 non-null  object
 3   Quantity     525461 non-null  int64
 4   InvoiceDate  525461 non-null  datetime64[ns]
 5   Price        525461 non-null  float64
 6   Customer ID  417534 non-null  float64
 7   Country      525461 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 32.1+ MB

In [9]:
customer_country=df1[['Country','Customer ID']].drop_duplicates()

In [10]:
customer_country.groupby(['Country'])['Customer ID'].aggregate('count').reset_index().sort_values('Customer ID', ascending=False)

                 Country  Customer ID
37        United Kingdom         4035
13               Germany           68
12                France           47
31                 Spain           25
24           Netherlands           23
28              Portugal           18
3                Belgium           17
32                Sweden           16
0              Australia           15
33           Switzerland           14
7        Channel Islands           12
18                 Italy           11
1                Austria           10
9                Denmark            9
11               Finland            8
8                 Cyprus            7
35                   USA            6
19                 Japan            6
10                  EIRE            5
38           Unspecified            5
26                Norway            5
14                Greece            4
36  United Arab Emirates            4
27                Poland            2
20                 Korea            2
17                Israel            2
2                Bahrain            2
25               Nigeria            1
23                 Malta            1
22             Lithuania            1
29                   RSA            1
30             Singapore            1
16               Iceland            1
34              Thailand            1
6                 Canada            1
5                 Brazil            1
39           West Indies            1
21               Lebanon            0
15             Hong Kong            0
4                Bermuda            0

In [11]:
df1 = df1.loc[df1['Country'] == 'United Kingdom']

In [12]:
df1.shape

(485852, 8)

In [13]:
df1.isnull().sum(axis=0)

Invoice             0
StockCode           0
Description      2928
Quantity            0
InvoiceDate         0
Price               0
Customer ID    106429
Country             0
dtype: int64

In [14]:
df1 = df1[pd.notnull(df1['Customer ID'])]

In [15]:
df1.isnull().sum(axis=0)

Invoice        0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
Price          0
Customer ID    0
Country        0
dtype: int64

In [16]:
df1.shape

(379423, 8)

In [17]:
customer_uk=df1[['Country','Customer ID']].drop_duplicates()
customer_uk.groupby(['Country'])['Customer ID'].aggregate('count').reset_index().sort_values('Customer ID', ascending=False)

          Country  Customer ID
0  United Kingdom         4035

In [18]:
df1.Quantity.min()

-9360

In [19]:
df1 = df1[(df1['Quantity']>0)]
df1.shape
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 370951 entries, 0 to 525460
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      370951 non-null  object
 1   StockCode    370951 non-null  object
 2   Description  370951 non-null  object
 3   Quantity     370951 non-null  int64
 4   InvoiceDate  370951 non-null  datetime64[ns]
 5   Price        370951 non-null  float64
 6   Customer ID  370951 non-null  float64
 7   Country      370951 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 25.5+ MB

In [20]:
customer_uk=df1[['Country','Customer ID']].drop_duplicates()
customer_uk.groupby(['Country'])['Customer ID'].aggregate('count').reset_index().sort_values('Customer ID', ascending=False)

          Country  Customer ID
0  United Kingdom         3971

In [21]:
df1.shape

(370951, 8)

In [22]:
#df1.to_csv('UKdatawithIndex.csv', index=True)

In [23]:
def unique_counts(df1):
   for i in df1.columns:
       count = df1[i].nunique()
       print(i, ": ", count)
unique_counts(df1)

Invoice :  17614
StockCode :  4001
Description :  4415
Quantity :  307
InvoiceDate :  16601
Price :  366
Customer ID :  3971
Country :  1

In [24]:
df1['TotalPrice'] = df1['Quantity'] * df1['Price']

In [25]:
df1['InvoiceDate'].min()

Timestamp('2009-12-01 07:45:00')

In [26]:
df1['InvoiceDate'].max()

Timestamp('2010-12-09 20:01:00')

In [27]:
import datetime as dt
NOW = dt.datetime(2010,12,10)
df1['InvoiceDate'] = pd.to_datetime(df1['InvoiceDate'])

In [28]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 370951 entries, 0 to 525460
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      370951 non-null  object
 1   StockCode    370951 non-null  object
 2   Description  370951 non-null  object
 3   Quantity     370951 non-null  int64
 4   InvoiceDate  370951 non-null  datetime64[ns]
 5   Price        370951 non-null  float64
 6   Customer ID  370951 non-null  float64
 7   Country      370951 non-null  object
 8   TotalPrice   370951 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 28.3+ MB

In [29]:
df1.head(2)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom,83.4
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0

In [30]:
df1.InvoiceDate

0        2009-12-01 07:45:00
1        2009-12-01 07:45:00
2        2009-12-01 07:45:00
3        2009-12-01 07:45:00
4        2009-12-01 07:45:00
                 ...
525456   2010-12-09 20:01:00
525457   2010-12-09 20:01:00
525458   2010-12-09 20:01:00
525459   2010-12-09 20:01:00
525460   2010-12-09 20:01:00
Name: InvoiceDate, Length: 370951, dtype: datetime64[ns]

In [31]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 370951 entries, 0 to 525460
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      370951 non-null  object
 1   StockCode    370951 non-null  object
 2   Description  370951 non-null  object
 3   Quantity     370951 non-null  int64
 4   InvoiceDate  370951 non-null  datetime64[ns]
 5   Price        370951 non-null  float64
 6   Customer ID  370951 non-null  float64
 7   Country      370951 non-null  object
 8   TotalPrice   370951 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 28.3+ MB

In [35]:
df1.to_csv('UKdataFinal.csv')

# RFM Customer Segmentation using Quantiles

In [36]:
rfmTable = df1.groupby('Customer ID').agg({'InvoiceDate': lambda x: (NOW - x.max()).days, 'Invoice': lambda x: len(x), 'TotalPrice': lambda x: x.sum()})
rfmTable['InvoiceDate'] = rfmTable['InvoiceDate'].astype(int)
rfmTable.rename(columns={'InvoiceDate': 'recency', 
                         'Invoice': 'frequency', 
                         'TotalPrice': 'monetary_value'}, inplace=True)

In [37]:
rfmTable.head()

             recency  frequency  monetary_value
Customer ID
12346.0          164         33          372.86
12608.0           39         16          415.79
12745.0          121         22          723.85
12746.0          175         17          254.55
12747.0            4        154         5080.53

In [38]:
rfmTable.count()

recency           3971
frequency         3971
monetary_value    3971
dtype: int64

In [39]:
first_customer=df1[df1['Customer ID']==12346.0]
first_customer

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
27994,491725,TEST001,This is a test product.,10,2009-12-14 08:34:00,4.50,12346.0,United Kingdom,45.00
28251,491742,TEST001,This is a test product.,5,2009-12-14 11:00:00,4.50,12346.0,United Kingdom,22.50
28254,491744,TEST001,This is a test product.,5,2009-12-14 11:02:00,4.50,12346.0,United Kingdom,22.50
39398,492718,TEST001,This is a test product.,5,2009-12-18 10:47:00,4.50,12346.0,United Kingdom,22.50
39411,492722,TEST002,This is a test product.,1,2009-12-18 10:55:00,1.00,12346.0,United Kingdom,1.00
45228,493410,TEST001,This is a test product.,5,2010-01-04 09:24:00,4.50,12346.0,United Kingdom,22.50
45230,493412,TEST001,This is a test product.,5,2010-01-04 09:53:00,4.50,12346.0,United Kingdom,22.50
56117,494450,TEST001,This is a test product.,5,2010-01-14 13:50:00,4.50,12346.0,United Kingdom,22.50
66084,495295,TEST001,This is a test product.,5,2010-01-22 13:30:00,4.50,12346.0,United Kingdom,22.50
107800,499763,20682,RED SPOTTY CHILDS UMBRELLA,1,2010-03-02 13:08:00,3.25,12346.0,United Kingdom,3.25
107801,499763,20679,EDWARDIAN PARASOL RED,1,2010-03-02 13:08:00,5.95,12346.0,United Kingdom,5.95
107802,499763,15056N,EDWARDIAN PARASOL NATURAL,1,2010-03-02 13:08:00,5.95,12346.0,United Kingdom,5.95
107803,499763,15056BL,EDWARDIAN PARASOL BLACK,1,2010-03-02 13:08:00,5.95,12346.0,United Kingdom,5.95
107804,499763,15056P,EDWARDIAN PARASOL PINK,1,2010-03-02 13:08:00,5.95,12346.0,United Kingdom,5.95
253028,513774,21524,DOORMAT SPOTTY HOME SWEET HOME,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253029,513774,22692,DOORMAT WELCOME TO OUR HOME,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253030,513774,22660,DOORMAT I LOVE LONDON,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253031,513774,22687,DOORMAT CHRISTMAS VILLAGE,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253032,513774,48173C,DOORMAT BLACK FLOCK,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253033,513774,22691,DOORMAT WELCOME SUNRISE,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253034,513774,48111,DOORMAT 3 SMILEY CATS,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253035,513774,22690,DOORMAT HOME SWEET HOME BLUE,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253036,513774,21523,DOORMAT FANCY FONT HOME SWEET HOME,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253037,513774,48138,DOORMAT UNION FLAG,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253038,513774,22689,DOORMAT MERRY CHRISTMAS RED,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253039,513774,22365,DOORMAT RESPECTABLE HOUSE,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253040,513774,48185,DOORMAT FAIRY CAKE,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253041,513774,22688,DOORMAT PEACE ON EARTH BLUE,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253042,513774,48188,DOORMAT WELCOME PUPPIES,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253043,513774,48187,DOORMAT NEW ENGLAND,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253044,513774,22366,DOORMAT AIRMAIL,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253045,513774,20685,DOORMAT RED SPOT,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49
253046,513774,21955,DOORMAT UNION JACK GUNS AND ROSES,1,2010-06-28 13:53:00,7.49,12346.0,United Kingdom,7.49

In [40]:
first_customer.TotalPrice.max()

45.0

In [41]:
#Split the metricslit the metrics

In [42]:
quantiles = rfmTable.quantile(q=[0.25,0.5,0.75])
quantiles = quantiles.to_dict()

In [43]:
#Create a segmented RFM table

In [44]:
segmented_rfm = rfmTable

In [45]:
def RScore(x,p,d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.50]:
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4
    
def FMScore(x,p,d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1

In [46]:
segmented_rfm['r_quartile'] = segmented_rfm['recency'].apply(RScore, args=('recency',quantiles,))
segmented_rfm['f_quartile'] = segmented_rfm['frequency'].apply(FMScore, args=('frequency',quantiles,))
segmented_rfm['m_quartile'] = segmented_rfm['monetary_value'].apply(FMScore, args=('monetary_value',quantiles,))
segmented_rfm.head()

,recency,frequency,monetary_value,r_quartile,f_quartile,m_quartile
Customer ID,,,,,,
12346.0,164,33,372.86,4,3,3
12608.0,39,16,415.79,2,4,3
12745.0,121,22,723.85,3,3,2
12746.0,175,17,254.55,4,4,4
12747.0,4,154,5080.53,1,1,1

In [47]:
segmented_rfm['RFMScore'] = segmented_rfm.r_quartile.map(str) + segmented_rfm.f_quartile.map(str) + segmented_rfm.m_quartile.map(str)
segmented_rfm.head()

,recency,frequency,monetary_value,r_quartile,f_quartile,m_quartile,RFMScore
Customer ID,,,,,,,
12346.0,164,33,372.86,4,3,3,433
12608.0,39,16,415.79,2,4,3,243
12745.0,121,22,723.85,3,3,2,332
12746.0,175,17,254.55,4,4,4,444
12747.0,4,154,5080.53,1,1,1,111

In [48]:
segmented_rfm.RFMScore.max()

'444'

## Who are the top 10 of our customers!

In [49]:
segmented_rfm[segmented_rfm['RFMScore']=='444'].sort_values('monetary_value', ascending=False).head(10)

,recency,frequency,monetary_value,r_quartile,f_quartile,m_quartile,RFMScore
Customer ID,,,,,,,
16135.0,218,18,301.90,4,4,4,444
17678.0,238,12,301.65,4,4,4,444
13706.0,261,18,300.38,4,4,4,444
14797.0,142,16,300.31,4,4,4,444
14840.0,174,18,299.86,4,4,4,444
17718.0,279,17,299.83,4,4,4,444
18212.0,312,12,298.30,4,4,4,444
14835.0,163,2,297.00,4,4,4,444
17927.0,356,10,294.00,4,4,4,444
15718.0,175,18,293.79,4,4,4,444

## Who are the bottom 10 of our customers!

In [50]:
segmented_rfm[segmented_rfm['RFMScore']=='111'].sort_values('monetary_value', ascending=False).count()

recency           378
frequency         378
monetary_value    378
r_quartile        378
f_quartile        378
m_quartile        378
RFMScore          378
dtype: int64

In [51]:
segmented_rfm.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3971 entries, 12346.0 to 18287.0
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   recency         3971 non-null   int32
 1   frequency       3971 non-null   int64
 2   monetary_value  3971 non-null   float64
 3   r_quartile      3971 non-null   int64
 4   f_quartile      3971 non-null   int64
 5   m_quartile      3971 non-null   int64
 6   RFMScore        3971 non-null   object
dtypes: float64(1), int32(1), int64(4), object(1)
memory usage: 232.7+ KB

In [52]:
segmented_rfm[segmented_rfm['RFMScore']=='111']

,recency,frequency,monetary_value,r_quartile,f_quartile,m_quartile,RFMScore
Customer ID,,,,,,,
12747.0,4,154,5080.53,1,1,1,111
12748.0,0,2634,22879.66,1,1,1,111
12838.0,8,300,2715.35,1,1,1,111
12839.0,2,262,4480.31,1,1,1,111
12841.0,4,282,3518.33,1,1,1,111
...,...,...,...,...,...,...,...
18168.0,7,273,2600.33,1,1,1,111
18225.0,0,308,7545.14,1,1,1,111
18226.0,13,286,6650.83,1,1,1,111
18245.0,14,283,3757.92,1,1,1,111
18260.0,9,277,7318.91,1,1,1,111

In [53]:
# Create a new column 'segment_RFM_lifetimes' in rfm_rounded and fill it with values using the segment map
segment_map = {
    r'22': 'hibernating',
    r'[1-2][1-2]': 'lost',
    r'15': 'can\'t lose',
    r'[1-2][3-5]': 'at risk',
    r'3[1-2]': 'about to sleep',
    r'33': 'need attention',
    r'55': 'champions',
    r'[3-5][4-5]': 'loyal customers',
    r'41': 'promising',
    r'51': 'new customers',
    r'[4-5][2-3]': 'potential loyalists'
}

# Map the recency and frequency to strings and concatenate them
segmented_rfm['segment_RFM_quantiles'] = segmented_rfm['r_quartile'].map(str) + segmented_rfm['f_quartile'].map(str)
# Replace the concatenated strings with the segment labels
segmented_rfm['segment_RFM_quantiles'] = segmented_rfm['segment_RFM_quantiles'].replace(segment_map, regex=True)

# Display the value counts of the new column
segmented_rfm['segment_RFM_quantiles'].value_counts()

segment_RFM_quantiles
lost                   1064
loyal customers         727
at risk                 673
potential loyalists     478
about to sleep          428
hibernating             281
need attention          275
promising                45
Name: count, dtype: int64

In [54]:
segmented_rfm.head()

,recency,frequency,monetary_value,r_quartile,f_quartile,m_quartile,RFMScore,segment_RFM_quantiles
Customer ID,,,,,,,,
12346.0,164,33,372.86,4,3,3,433,potential loyalists
12608.0,39,16,415.79,2,4,3,243,at risk
12745.0,121,22,723.85,3,3,2,332,need attention
12746.0,175,17,254.55,4,4,4,444,loyal customers
12747.0,4,154,5080.53,1,1,1,111,lost

In [55]:
segmented_rfm.loc[12747.0]
#segmented_rfm.to_csv('temp_segmented_rfm.csv',index=True)

recency                        4
frequency                    154
monetary_value           5080.53
r_quartile                     1
f_quartile                     1
m_quartile                     1
RFMScore                     111
segment_RFM_quantiles       lost
Name: 12747.0, dtype: object

In [56]:
segmented_rfm.head()

,recency,frequency,monetary_value,r_quartile,f_quartile,m_quartile,RFMScore,segment_RFM_quantiles
Customer ID,,,,,,,,
12346.0,164,33,372.86,4,3,3,433,potential loyalists
12608.0,39,16,415.79,2,4,3,243,at risk
12745.0,121,22,723.85,3,3,2,332,need attention
12746.0,175,17,254.55,4,4,4,444,loyal customers
12747.0,4,154,5080.53,1,1,1,111,lost

# RFM segmentation using Quantiles ends here

In [57]:
# RFM Customer Segmentation using LIFETIMES package

In [58]:
from lifetimes.plotting import *
from lifetimes.utils import *
#from lifetimes.estimation import *

data = summary_data_from_transaction_data(df1, 'Customer ID', 'InvoiceDate', 
                                          monetary_value_col='TotalPrice', observation_period_end='2010-12-9')
data.head()

             frequency  recency      T  monetary_value
Customer ID
12346.0            6.0    196.0  360.0       47.143333
12608.0            0.0      0.0   39.0        0.000000
12745.0            1.0     88.0  209.0      266.930000
12746.0            0.0      0.0  175.0        0.000000
12747.0           15.0    363.0  367.0      313.325333

## R F T M values are not in scale of 1 to 4. 

# To compare it with RFM generated using Quantiles method (which is in scale of 1 to 4), we will transform the RFM values from Lifetimes package using MinMaxScalar using the feature_range.

In [59]:
from sklearn.preprocessing import MinMaxScaler

# Initialize MinMaxScaler with the range 1 to 4
scaler = MinMaxScaler(feature_range=(1, 4))

# Apply MinMaxScaler to the RFM data columns
scaled_data = scaler.fit_transform(data[['frequency', 'recency', 'T', 'monetary_value']])

# Create a new DataFrame with the scaled data
scaled_data_df = pd.DataFrame(scaled_data, index=data.index, columns=['frequency', 'recency', 'T', 'monetary_value'])

# Display the head of the scaled data dataframe
print(scaled_data_df.head())

             frequency   recency         T  monetary_value
Customer ID
12346.0       1.165138  2.576408  3.895442        1.017124
12608.0       1.000000  1.000000  1.313673        1.000000
12745.0       1.027523  1.707775  2.680965        1.096960
12746.0       1.000000  1.000000  2.407507        1.000000
12747.0       1.412844  3.919571  3.951743        1.113812

## now use the below value range to map the values in the columns 

# 1.0 to 1.75 = 1 
# 1.76 to 2.67 = 2 
# 2.68 to 3.4 = 3
# 3.5 to 4 = 4

In [60]:
import numpy as np

# Define the function to map the values to the range 1-4 based on the given intervals
def map_values_to_range(x):
    if 1.0 <= x <= 1.75:
        return 1
    elif 1.76 <= x <= 2.67:
        return 2
    elif 2.68 <= x <= 3.4:
        return 3
    elif 3.5 <= x <= 4.0:
        return 4
    else:
        return np.nan

# Apply the function to each column in the scaled_data_df dataframe
mapped_data_df = scaled_data_df.applymap(map_values_to_range)

# Display the head of the mapped data dataframe
print(mapped_data_df.head())

             frequency  recency    T  monetary_value
Customer ID
12346.0              1      2.0  4.0               1
12608.0              1      1.0  1.0               1
12745.0              1      1.0  3.0               1
12746.0              1      1.0  2.0               1
12747.0              1      4.0  4.0               1

In [61]:
# Calculate the value counts for each column in the mapped_data_df dataframe
value_counts_frequency = mapped_data_df['frequency'].value_counts()
value_counts_recency = mapped_data_df['recency'].value_counts()
value_counts_T = mapped_data_df['T'].value_counts()
value_counts_monetary_value = mapped_data_df['monetary_value'].value_counts()

# Display the value counts for each column
print('Frequency Value Counts:')
print(value_counts_frequency)
print('\nRecency Value Counts:')
print(value_counts_recency)
print('\nT Value Counts:')
print(value_counts_T)
print('\nMonetary Value Counts:')
print(value_counts_monetary_value)

Frequency Value Counts:
frequency
1    3937
2      28
4       3
3       3
Name: count, dtype: int64

Recency Value Counts:
recency
1.0    1900
2.0     693
3.0     652
4.0     624
Name: count, dtype: int64

T Value Counts:
T
4.0    1264
3.0     984
1.0     880
2.0     698
Name: count, dtype: int64

Monetary Value Counts:
monetary_value
1    3957
2      12
3       1
4       1
Name: count, dtype: int64

In [62]:
mapped_data_df.isna().sum()

frequency           0
recency           102
T                 145
monetary_value      0
dtype: int64

In [63]:
# WE FILLED THE NULL VALUES WITH MODE

In [64]:
# Fill the null values in the 'recency' and 'T' columns with the mode of their respective columns
mode_recency = mapped_data_df['recency'].mode()[0]
mode_T = mapped_data_df['T'].mode()[0]

mapped_data_df['recency'].fillna(mode_recency, inplace=True)
mapped_data_df['T'].fillna(mode_T, inplace=True)

# Display the head of the dataframe to confirm the changes
print(mapped_data_df.head())

             frequency  recency    T  monetary_value
Customer ID
12346.0              1      2.0  4.0               1
12608.0              1      1.0  1.0               1
12745.0              1      1.0  3.0               1
12746.0              1      1.0  2.0               1
12747.0              1      4.0  4.0               1

In [65]:
# Convert all columns in the dataframe to integer type
mapped_data_df = mapped_data_df.astype(int)

# Display the head of the dataframe to confirm the changes
mapped_data_df.head()

             frequency  recency  T  monetary_value
Customer ID
12346.0              1        2  4               1
12608.0              1        1  1               1
12745.0              1        1  3               1
12746.0              1        1  2               1
12747.0              1        4  4               1

In [66]:
rfm_rounded=mapped_data_df

In [67]:
rfm_rounded.head()

             frequency  recency  T  monetary_value
Customer ID
12346.0              1        2  4               1
12608.0              1        1  1               1
12745.0              1        1  3               1
12746.0              1        1  2               1
12747.0              1        4  4               1

In [68]:
# Dropping the 'T' column from the rfm_rounded dataframe
rfm_rounded.drop(columns='T', inplace=True)
# Display the head of the dataframe to confirm the column is dropped
rfm_rounded.head()

             frequency  recency  monetary_value
Customer ID
12346.0              1        2               1
12608.0              1        1               1
12745.0              1        1               1
12746.0              1        1               1
12747.0              1        4               1

In [69]:
# Create a new column 'segment_RFM_lifetimes' in rfm_rounded and fill it with values using the segment map
segment_map = {
    r'22': 'hibernating',
    r'[1-2][1-2]': 'lost',
    r'15': 'can\'t lose',
    r'[1-2][3-5]': 'at risk',
    r'3[1-2]': 'about to sleep',
    r'33': 'need attention',
    r'55': 'champions',
    r'[3-5][4-5]': 'loyal customers',
    r'41': 'promising',
    r'51': 'new customers',
    r'[4-5][2-3]': 'potential loyalists'
}

# Map the recency and frequency to strings and concatenate them
rfm_rounded['segment_RFM_lifetimes'] = rfm_rounded['recency'].map(str) + rfm_rounded['frequency'].map(str)
# Replace the concatenated strings with the segment labels
rfm_rounded['segment_RFM_lifetimes'] = rfm_rounded['segment_RFM_lifetimes'].replace(segment_map, regex=True)

# Display the value counts of the new column
rfm_rounded['segment_RFM_lifetimes'].value_counts()

segment_RFM_lifetimes
lost                   2695
about to sleep          652
promising               592
potential loyalists      29
loyal customers           3
Name: count, dtype: int64

In [70]:
rfm_rounded.head()

             frequency  recency  monetary_value segment_RFM_lifetimes
Customer ID
12346.0              1        2               1                  lost
12608.0              1        1               1                  lost
12745.0              1        1               1                  lost
12746.0              1        1               1                  lost
12747.0              1        4               1             promising

## Create a new dataframe with only CustomerID and segment_RFM_lifetimes columns
# rfm_segment_only = rfm_rounded[['segment_RFM_lifetimes']].copy()
# rfm_segment_only.reset_index(inplace=True)

#  Display the head of the new dataframe
# rfm_segment_only.head()

In [71]:
# rfm_segment_only.to_csv('rfm_segment_only.csv',index=True)

## IN THE END, WE HAVE 2 DF, 
# rfm_rounded from lifetimes package 
# egmented_rfm from quantiles package

In [72]:
# from LIFETIMES package
rfm_rounded.head()

             frequency  recency  monetary_value segment_RFM_lifetimes
Customer ID
12346.0              1        2               1                  lost
12608.0              1        1               1                  lost
12745.0              1        1               1                  lost
12746.0              1        1               1                  lost
12747.0              1        4               1             promising

In [73]:
# from Quantiles 
segmented_rfm.head()

,recency,frequency,monetary_value,r_quartile,f_quartile,m_quartile,RFMScore,segment_RFM_quantiles
Customer ID,,,,,,,,
12346.0,164,33,372.86,4,3,3,433,potential loyalists
12608.0,39,16,415.79,2,4,3,243,at risk
12745.0,121,22,723.85,3,3,2,332,need attention
12746.0,175,17,254.55,4,4,4,444,loyal customers
12747.0,4,154,5080.53,1,1,1,111,lost

In [74]:
rfm_rounded.to_csv('rfm_rounded.csv')

In [75]:
segmented_rfm.to_csv('segmented_rfm.csv')

In [76]:
#####################################################################